In [76]:
import pandas as pd
import numpy as np

In [77]:
a = pd.read_csv('adultKNN.csv')

In [78]:
a.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

In [79]:
a.shape

(48842, 15)

In [80]:
a.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

#### There is no null values in anyone columns

In [81]:
a.isnull().sum()[a.isnull().sum()>0]

Series([], dtype: int64)

In [82]:
a.income.value_counts()

<=50K    37155
>50K     11687
Name: income, dtype: int64

In [83]:
list(a.education.unique())

['11th',
 'HS-grad',
 'Assoc-acdm',
 'Some-college',
 '10th',
 'Prof-school',
 '7th-8th',
 'Bachelors',
 'Masters',
 'Doctorate',
 '5th-6th',
 'Assoc-voc',
 '9th',
 '12th',
 '1st-4th',
 'Preschool']

In [84]:
a.workclass.value_counts()

Private             33906
Self-emp-not-inc     3862
Local-gov            3136
?                    2799
State-gov            1981
Self-emp-inc         1695
Federal-gov          1432
Without-pay            21
Never-worked           10
Name: workclass, dtype: int64

In [85]:
a.education.replace({'Preschool':1, '1st-4th':2, '5th-6th':3, '7th-8th':4, '9th':5, '10th':6, '11th':7, '12th':8,
                     'Some-college':9, 'Prof-school':10,'Assoc-voc':11,'HS-grad':12, 'Bachelors':13,'Assoc-acdm':14, 
                      'Masters':15,'Doctorate':16},inplace = True)

In [86]:
a.occupation.value_counts()

Prof-specialty       6172
Craft-repair         6112
Exec-managerial      6086
Adm-clerical         5611
Sales                5504
Other-service        4923
Machine-op-inspct    3022
?                    2809
Transport-moving     2355
Handlers-cleaners    2072
Farming-fishing      1490
Tech-support         1446
Protective-serv       983
Priv-house-serv       242
Armed-Forces           15
Name: occupation, dtype: int64

In [87]:
a.workclass.value_counts()

Private             33906
Self-emp-not-inc     3862
Local-gov            3136
?                    2799
State-gov            1981
Self-emp-inc         1695
Federal-gov          1432
Without-pay            21
Never-worked           10
Name: workclass, dtype: int64

In [88]:
a.shape

(48842, 15)

In [89]:
a.replace({'?': np.nan})

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,7,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,12,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,14,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,9,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,NaN,103497,9,10,Never-married,NaN,Own-child,White,Female,0,0,30,United-States,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48837,27,Private,257302,14,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
48838,40,Private,154374,12,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
48839,58,Private,151910,12,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
48840,22,Private,201490,12,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
48841,52,Self-emp-inc,287927,12,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [90]:
a.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [91]:
a.replace({'?': None}).dropna().head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,7,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,12,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,14,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,9,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
5,34,Private,198693,6,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K

In [15]:
a.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

#### Lable encoder

In [16]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [17]:
a.select_dtypes(include='object').columns

Index(['workclass', 'marital-status', 'occupation', 'relationship', 'race',
       'gender', 'native-country', 'income'],
      dtype='object')

In [18]:
a[a.select_dtypes(include='object').columns] = a[a.select_dtypes(include='object').columns].apply(le.fit_transform)

In [19]:
a.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,4,226802,7,7,4,7,3,2,1,0,0,40,39,0
1,38,4,89814,12,9,2,5,0,4,1,0,0,50,39,0
2,28,2,336951,14,12,2,11,0,4,1,0,0,40,39,1
3,44,4,160323,9,10,2,7,0,2,1,7688,0,40,39,1
4,18,0,103497,9,10,4,0,3,4,0,0,0,30,39,0

In [20]:
a.dtypes

age                int64
workclass          int32
fnlwgt             int64
education          int64
educational-num    int64
marital-status     int32
occupation         int32
relationship       int32
race               int32
gender             int32
capital-gain       int64
capital-loss       int64
hours-per-week     int64
native-country     int32
income             int32
dtype: object

___________________________________________________________________________________________________________

### Sampling

In [21]:
from sklearn.model_selection import train_test_split

In [22]:
train_a, test_a = train_test_split(a,test_size=0.2)   #split data for train and test

In [23]:
a.shape                                              # Original dataframe shape

(48842, 15)

In [24]:
train_a.shape                                       # Train dataframe shape

(39073, 15)

In [25]:
test_a.shape                                        # test dataframe shape

(9769, 15)

In [26]:
train_a_x = train_a.iloc[ : ,:-1]
train_a_y = train_a.iloc[ : ,-1]

In [27]:
test_a_x =test_a.iloc[ : , :-1]
test_a_y = test_a.iloc[ : ,-1]

In [28]:
train_a_x.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country
47451,55,4,266343,12,9,2,10,0,4,1,0,0,46,39
40249,42,4,183241,15,14,2,10,5,4,0,0,0,45,39
26387,33,4,229716,12,9,0,1,1,4,1,0,0,38,39
27100,44,6,172296,9,10,5,12,4,4,1,0,0,60,39
18628,18,4,675421,5,5,4,6,3,4,1,594,0,40,39

In [29]:
test_a_x.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country
29058,48,4,247685,9,10,0,3,1,4,1,3325,0,40,39
7142,58,4,299991,7,7,0,1,1,4,0,3674,0,40,39
40471,59,5,200453,15,14,2,12,0,4,1,0,0,40,39
22735,40,4,104719,9,10,2,6,0,4,1,0,0,40,39
31654,17,4,95799,7,7,4,12,3,4,0,0,0,18,39

## CrossTab

In [30]:
a = pd.read_csv('adultKNN.csv')

In [31]:
a.shape

(48842, 15)

In [32]:
a.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,?,103497,Some-college,10,Never-married,?,Own-child,White,Female,0,0,30,United-States,<=50K

### Gender and Income

In [33]:
pd.crosstab(a.gender,a.income)

income  <=50K  >50K
gender
Female  14423  1769
Male    22732  9918

In [34]:
(14423/(14423+1769))*100   # 89% of female has income less than 50k

89.07485177865613

In [35]:
(1769/(1769+14423))*100   # around 11% of female has income more than 50k

10.925148221343873

In [36]:
(22732/(22732+9918))*100  # around 70% of male have income less than 50k

69.62327718223584

In [37]:
(9918/(22732+9918))*100 # 30% of male have income greater than 50k

30.37672281776417

### Native-country and Income

In [38]:
pd.crosstab(a.occupation,a.income,margins=True)

income             <=50K   >50K    All
occupation
?                   2544    265   2809
Adm-clerical        4843    768   5611
Armed-Forces          10      5     15
Craft-repair        4729   1383   6112
Exec-managerial     3178   2908   6086
Farming-fishing     1317    173   1490
Handlers-cleaners   1934    138   2072
Machine-op-inspct   2650    372   3022
Other-service       4719    204   4923
Priv-house-serv      239      3    242
Prof-specialty      3388   2784   6172
Protective-serv      675    308    983
Sales               4029   1475   5504
Tech-support        1026    420   1446
Transport-moving    1874    481   2355
All                37155  11687  48842

In [39]:
(11687/48842)*100 # 24% of adult have income more than 50k

23.928176569346054

## hours-per-week and income

In [40]:
h=pd.crosstab(a['hours-per-week'],a.income)

In [41]:
h

income          <=50K  >50K
hours-per-week
1                  24     3
2                  41    12
3                  56     3
4                  78     6
5                  86     9
...               ...   ...
95                  1     1
96                  8     1
97                  1     1
98                 11     3
99                 96    41

[96 rows x 2 columns]

In [42]:
h['<=50K'].max()

17953

In [46]:
pd.crosstab(a.relationship,a.income,margins=True)

income          <=50K   >50K    All
relationship
Husband         10870   8846  19716
Not-in-family   11307   1276  12583
Other-relative   1454     52   1506
Own-child        7470    111   7581
Unmarried        4816    309   5125
Wife             1238   1093   2331
All             37155  11687  48842

In [44]:
(10870/(10870+8846))*100   # 55% husband relationship adult hav income less than 50k

55.13288699533374

In [45]:
(8846/(10870+8846))*100    # around 45% husband relationship adult hav income Greater than 50k

44.86711300466626